#include <iostream>

int myobits[4];
int flag = 1;
int action(int arr[]){
    // здесь входящий вектор как-то обрабатывается и функция возвращает число, 
    // которое активирует какую-либо степень свободы
}

int main() {
    
    while (flag == 1)
    {
        // readsensor() читаем показания датчиков
        //на вход приходят пороговые значения от 4-х миосенсоров в виде массива
        // записываем их в массив myobits[]
        // передаем массив в функцию action(myobits)
        

    }
    
}